Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateSlabEdgeError Property
 Could not create Slab Edge. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateSlabEdgeError { get; }
Public Shared ReadOnly Property CannotCreateSlabEdgeError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateSlabEdgeError {
	FailureDefinitionId^ get ();
}
static member CannotCreateSlabEdgeError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace